{
  "type": "panel",
  "i18n": false,
  "items": {
    "_authInfo": {
      "type": "staticText",
      "text": {
        "en": "ℹ️ How to login: After saving the settings and starting the adapter, a login URL will appear in the adapter log. Open this URL in your browser and log in with your Xiaomi account. The adapter will then automatically connect.",
        "de": "ℹ️ So melden Sie sich an: Nach dem Speichern der Einstellungen und dem Starten des Adapters erscheint eine Login-URL im Adapter-Log. Öffnen Sie diese URL in Ihrem Browser und melden Sie sich mit Ihrem Xiaomi-Konto an. Der Adapter verbindet sich dann automatisch.",
        "ru": "ℹ️ Как войти: После сохранения настроек и запуска адаптера в журнале адаптера появится URL для входа. Откройте этот URL в браузере и войдите в свою учетную запись Xiaomi. Адаптер подключится автоматически.",
        "pt": "ℹ️ Como fazer login: Após salvar as configurações e iniciar o adaptador, um URL de login aparecerá no log do adaptador. Abra este URL no navegador e faça login com sua conta Xiaomi. O adaptador se conectará automaticamente.",
        "nl": "ℹ️ Inloggen: Na het opslaan van de instellingen en het starten van de adapter verschijnt er een inlog-URL in het adapter-logboek. Open deze URL in uw browser en log in met uw Xiaomi-account. De adapter maakt dan automatisch verbinding.",
        "fr": "ℹ️ Comment se connecter : Après avoir enregistré les paramètres et démarré l'adaptateur, une URL de connexion apparaîtra dans le journal de l'adaptateur. Ouvrez cette URL dans votre navigateur et connectez-vous avec votre compte Xiaomi. L'adaptateur se connectera alors automatiquement.",
        "it": "ℹ️ Come accedere: Dopo aver salvato le impostazioni e avviato l'adattatore, un URL di accesso apparirà nel registro dell'adattatore. Apri questo URL nel browser e accedi con il tuo account Xiaomi. L'adattatore si connetterà automaticamente.",
        "es": "ℹ️ Cómo iniciar sesión: Después de guardar la configuración e iniciar el adaptador, aparecerá una URL de inicio de sesión en el registro del adaptador. Abra esta URL en su navegador e inicie sesión con su cuenta Xiaomi. El adaptador se conectará automáticamente.",
        "pl": "ℹ️ Jak się zalogować: Po zapisaniu ustawień i uruchomieniu adaptera w dzienniku adaptera pojawi się adres URL logowania. Otwórz ten adres URL w przeglądarce i zaloguj się na swoje konto Xiaomi. Adapter połączy się automatycznie.",
        "zh-cn": "ℹ️ 如何登录：保存设置并启动适配器后，适配器日志中将显示登录URL。在浏览器中打开此URL并使用您的小米帐户登录。适配器将自动连接。"
      },
      "style": {
        "fontSize": "16px",
        "fontWeight": "500"
      },
      "newLine": true,
      "sm": 12
    },
    "region": {
      "type": "select",
      "newLine": true,
      "sm": 3,
      "options": [
        {
          "label": "Deutschland",
          "value": "de"
        },
        {
          "label": "China",
          "value": "cn"
        },
        {
          "label": "Russland",
          "value": "ru"
        },
        {
          "label": "Taiwan",
          "value": "tw"
        },
        {
          "label": "Singapur",
          "value": "sg"
        },
        {
          "label": "USA",
          "value": "us"
        }
      ],
      "label": {
        "en": "Region",
        "de": "Region",
        "ru": "Регион",
        "pt": "Região",
        "nl": "Region",
        "fr": "Région",
        "it": "Regione",
        "es": "Región",
        "pl": "Region",
        "uk": "Регіон",
        "zh-cn": "区域"
      }
    },
    "interval": {
      "type": "number",
      "newLine": true,
      "min": 1,
      "sm": 2,
      "label": {
        "en": "Update interval (in minutes)",
        "de": "Aktualisierungsintervall (in Minuten)",
        "ru": "Интервал обновления (в минутах)",
        "pt": "Intervalo de atualização (em minutos)",
        "nl": "Update-interval (in minuten)",
        "fr": "Intervalle de mise à jour (en minutes)",
        "it": "Intervallo di aggiornamento (in minuti)",
        "es": "Intervalo de actualización (en minutos)",
        "pl": "Interwał aktualizacji (w minutach)",
        "zh-cn": "更新间隔（分钟）"
      }
    }
  }
}
